In [1]:
import pandas as pd

In [2]:
s = pd.Series([10, 20, 30, 40, 50])

In [3]:
s.dtypes

dtype('int64')

In [8]:
s[0:2]

0    10
1    20
dtype: int64

In [7]:
s.iloc[0]

np.int64(10)

In [12]:
index = ["apple", 'banana', 'grapes', 'orange', 'strawberry']

In [13]:
index

['apple', 'banana', 'grapes', 'orange', 'strawberry']

In [15]:
s.iloc[3]

np.int64(40)

In [16]:
s.loc[3]

np.int64(40)

In [17]:
s.index = index

In [18]:
s

apple         10
banana        20
grapes        30
orange        40
strawberry    50
dtype: int64

In [19]:
s['grapes']

np.int64(30)

In [21]:
s.iloc[2]

np.int64(30)

In [22]:
s.loc['grapes']

np.int64(30)

In [23]:
s['banana': 'orange']

banana    20
grapes    30
orange    40
dtype: int64

In [24]:
fruit_protein = {
    "Avocado": 2.0,       # grams of protein
    "Guava": 2.6,
    "Blackberries": 2.0,
    "Oranges": 0.9,
    "Banana": 1.1,
    "Apples": 0.3,
    "Kiwi": 1.1,
    "Pomegranate": 1.7,
    "Mango": 0.8,
    "Cherries": 1.0
}

In [26]:
s2 = pd.Series(fruit_protein, name='Protein')
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

In [28]:
# conditional selection: 
s2[s2 > 1]

Avocado         2.0
Guava           2.6
Blackberries    2.0
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
Name: Protein, dtype: float64

In [32]:
# Logical Operators: and, or, not 
s2[(s2>0.5) & (s2 <= 2)]

Avocado         2.0
Blackberries    2.0
Oranges         0.9
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

In [33]:
import numpy as np

In [34]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"], 
    "Age": [25, 30, 35, np.nan, 29, 25], 
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"], 
    "Salary": [5000, 6000, 7000, 6200, np.nan, 50000]
}

In [35]:
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Alice'],
 'Age': [25, 30, 35, nan, 29, 25],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'],
 'Salary': [5000, 6000, 7000, 6200, nan, 50000]}

In [37]:
df = pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR   5000.0
1      Bob  30.0         IT   6000.0
2  Charlie  35.0    Finance   7000.0
3    David   NaN         IT   6200.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [38]:
df.head()

      Name   Age Department  Salary
0    Alice  25.0         HR  5000.0
1      Bob  30.0         IT  6000.0
2  Charlie  35.0    Finance  7000.0
3    David   NaN         IT  6200.0
4      Eve  29.0         HR     NaN

In [40]:
df.tail(1)

    Name   Age Department   Salary
5  Alice  25.0         HR  50000.0

In [ ]:
# loc and iloc 

df.iloc[1: 3, :2] # row, columns

      Name   Age
1      Bob  30.0
2  Charlie  35.0

In [44]:
df.loc[1:2, ['Age', 'Department']]

    Age Department
1  30.0         IT
2  35.0    Finance

In [46]:
df[['Age', 'Department']]

    Age Department
0  25.0         HR
1  30.0         IT
2  35.0    Finance
3   NaN         IT
4  29.0         HR
5  25.0         HR

In [48]:
df.drop("Age", axis=1, inplace=True) # axis = 1 follow row, axis=0 follow column

In [49]:
df

      Name Department   Salary
0    Alice         HR   5000.0
1      Bob         IT   6000.0
2  Charlie    Finance   7000.0
3    David         IT   6200.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [51]:
df.shape

(6, 3)

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Department  6 non-null      object
 2   Salary      5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 276.0+ bytes

In [55]:
df.describe()

             Salary
count      5.000000
mean   14840.000000
std    19667.943461
min     5000.000000
25%     6000.000000
50%     6200.000000
75%     7000.000000
max    50000.000000

In [56]:
# Broadcasting 
df['Salary'] = df['Salary'] + 100
df

      Name Department   Salary
0    Alice         HR   5100.0
1      Bob         IT   6100.0
2  Charlie    Finance   7100.0
3    David         IT   6300.0
4      Eve         HR      NaN
5    Alice         HR  50100.0

In [57]:
# Renaming columns:
df.rename(columns={"Department": "Dept"}, inplace=True)

In [58]:
df

      Name     Dept   Salary
0    Alice       HR   5100.0
1      Bob       IT   6100.0
2  Charlie  Finance   7100.0
3    David       IT   6300.0
4      Eve       HR      NaN
5    Alice       HR  50100.0

In [61]:
df['Dept'].unique()

array(['HR', 'IT', 'Finance'], dtype=object)

In [62]:
df['Dept'].value_counts()

Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [63]:
df["Promoted Salary"] = df['Salary'] * 10

In [64]:
df

      Name     Dept   Salary  Promoted Salary
0    Alice       HR   5100.0          51000.0
1      Bob       IT   6100.0          61000.0
2  Charlie  Finance   7100.0          71000.0
3    David       IT   6300.0          63000.0
4      Eve       HR      NaN              NaN
5    Alice       HR  50100.0         501000.0

In [65]:
# Data cleaning 

df.isnull().sum()

Name               0
Dept               0
Salary             1
Promoted Salary    1
dtype: int64

In [71]:
df.dropna(how="any")

      Name     Dept   Salary  Promoted Salary
0    Alice       HR   5100.0          51000.0
1      Bob       IT   6100.0          61000.0
2  Charlie  Finance   7100.0          71000.0
3    David       IT   6300.0          63000.0
5    Alice       HR  50100.0         501000.0

In [69]:
df

      Name     Dept   Salary  Promoted Salary
0    Alice       HR   5100.0          51000.0
1      Bob       IT   6100.0          61000.0
2  Charlie  Finance   7100.0          71000.0
3    David       IT   6300.0          63000.0
4      Eve       HR      NaN              NaN
5    Alice       HR  50100.0         501000.0

In [75]:
df['Salary'].fillna(df['Salary'].mean())
df

      Name     Dept   Salary  Promoted Salary
0    Alice       HR   5100.0          51000.0
1      Bob       IT   6100.0          61000.0
2  Charlie  Finance   7100.0          71000.0
3    David       IT   6300.0          63000.0
4      Eve       HR  14940.0              NaN
5    Alice       HR  50100.0         501000.0

In [76]:
df

      Name     Dept   Salary  Promoted Salary
0    Alice       HR   5100.0          51000.0
1      Bob       IT   6100.0          61000.0
2  Charlie  Finance   7100.0          71000.0
3    David       IT   6300.0          63000.0
4      Eve       HR  14940.0              NaN
5    Alice       HR  50100.0         501000.0

In [82]:
df['Promoted Salary'].fillna(df['Promoted Salary'].median(), inplace=True)
df

/var/folders/bj/4zbr51sj4fsbvtllcchl3wzc0000gn/T/ipykernel_4698/4115684378.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Promoted Salary'].fillna(df['Promoted Salary'].median(), inplace=True)

      Name     Dept   Salary  Promoted Salary
0    Alice       HR   5100.0          51000.0
1      Bob       IT   6100.0          61000.0
2  Charlie  Finance   7100.0          71000.0
3    David       IT   6300.0          63000.0
4      Eve       HR  14940.0          63000.0
5    Alice       HR  50100.0         501000.0

In [83]:
df['Name'] = df['Name'].replace("Alice", "Thinh")
df

      Name     Dept   Salary  Promoted Salary
0    Thinh       HR   5100.0          51000.0
1      Bob       IT   6100.0          61000.0
2  Charlie  Finance   7100.0          71000.0
3    David       IT   6300.0          63000.0
4      Eve       HR  14940.0          63000.0
5    Thinh       HR  50100.0         501000.0

In [88]:
df_dup = df[df.duplicated(keep="last")]
df_dup

Empty DataFrame
Columns: [Name, Dept, Salary, Promoted Salary]
Index: []

In [87]:
df

      Name     Dept   Salary  Promoted Salary
0    Thinh       HR   5100.0          51000.0
1      Bob       IT   6100.0          61000.0
2  Charlie  Finance   7100.0          71000.0
3    David       IT   6300.0          63000.0
4      Eve       HR  14940.0          63000.0
5    Thinh       HR  50100.0         501000.0

In [90]:
df['Promoted Salary'] = df['Promoted Salary'].apply(lambda x: x/10 if x > 60000 else x)
df

      Name     Dept   Salary  Promoted Salary
0    Thinh       HR   5100.0          51000.0
1      Bob       IT   6100.0           6100.0
2  Charlie  Finance   7100.0           7100.0
3    David       IT   6300.0           6300.0
4      Eve       HR  14940.0           6300.0
5    Thinh       HR  50100.0          50100.0

In [92]:
name = 'alice_fernandes' 
df[['first_name', 'last_name']] = df['Name'].str.split("_" )

ValueError: Columns must be same length as key

In [97]:
# apply and lambda 
def multiplying_salary(x): 
    return x * 2

df['Salary'] = df['Salary'].apply(multiplying_salary)
df

      Name     Dept    Salary  Promoted Salary
0    Thinh       HR   81600.0          51000.0
1      Bob       IT   97600.0           6100.0
2  Charlie  Finance  113600.0           7100.0
3    David       IT  100800.0           6300.0
4      Eve       HR  239040.0           6300.0
5    Thinh       HR  801600.0          50100.0

In [98]:
df['Salary'] = df['Salary'].apply(lambda x: x / 2)
df

      Name     Dept    Salary  Promoted Salary
0    Thinh       HR   40800.0          51000.0
1      Bob       IT   48800.0           6100.0
2  Charlie  Finance   56800.0           7100.0
3    David       IT   50400.0           6300.0
4      Eve       HR  119520.0           6300.0
5    Thinh       HR  400800.0          50100.0

In [104]:
# Joins and Merges 
import pandas as pd

department_info = {
    "Dept": ["HR", "IT", "Finance"],
    "Location": ["New York", "San Francisco", "Chicago"],
    "Manager": ["Laura", "Steve", "Nina"]
}

df2 = pd.DataFrame(department_info)
print(df2)

      Dept       Location Manager
0       HR       New York   Laura
1       IT  San Francisco   Steve
2  Finance        Chicago    Nina

In [105]:
pd.concat([df, df2])

      Name     Dept    Salary  Promoted Salary       Location Manager
0    Thinh       HR   40800.0          51000.0            NaN     NaN
1      Bob       IT   48800.0           6100.0            NaN     NaN
2  Charlie  Finance   56800.0           7100.0            NaN     NaN
3    David       IT   50400.0           6300.0            NaN     NaN
4      Eve       HR  119520.0           6300.0            NaN     NaN
5    Thinh       HR  400800.0          50100.0            NaN     NaN
0      NaN       HR       NaN              NaN       New York   Laura
1      NaN       IT       NaN              NaN  San Francisco   Steve
2      NaN  Finance       NaN              NaN        Chicago    Nina

In [106]:
pd.concat([df, df2], axis=1)

      Name     Dept    Salary  Promoted Salary     Dept       Location Manager
0    Thinh       HR   40800.0          51000.0       HR       New York   Laura
1      Bob       IT   48800.0           6100.0       IT  San Francisco   Steve
2  Charlie  Finance   56800.0           7100.0  Finance        Chicago    Nina
3    David       IT   50400.0           6300.0      NaN            NaN     NaN
4      Eve       HR  119520.0           6300.0      NaN            NaN     NaN
5    Thinh       HR  400800.0          50100.0      NaN            NaN     NaN

In [107]:
pd.merge(df, df2, on='Dept')

      Name     Dept    Salary  Promoted Salary       Location Manager
0    Thinh       HR   40800.0          51000.0       New York   Laura
1      Bob       IT   48800.0           6100.0  San Francisco   Steve
2  Charlie  Finance   56800.0           7100.0        Chicago    Nina
3    David       IT   50400.0           6300.0  San Francisco   Steve
4      Eve       HR  119520.0           6300.0       New York   Laura
5    Thinh       HR  400800.0          50100.0       New York   Laura

In [ ]:
# importing file